[
  "exact", "apply", "intro", "intros", "rfl", "rw", "rewrite", "simp",
  "simp_all", "simp_rw", "ring", "ring_nf", "linarith", "nlinarith",
  "polyrith", "omega", "norm_num", "norm_cast", "push_cast",
  "constructor", "use", "exists", "cases", "rcases", "obtain",
  "have", "show", "refine", "refine'", "by_contra", "push_neg",
  "exact?", "apply?", "decide", "native_decide", "tauto", "tauto!",
  "field_simp", "div_simp", "induction", "induction'", "subst",
  "split_ifs", "split", "calc", "trans", "symm", "contradiction",
  "exfalso", "absurd", "left", "right", "and_intros", "fconstructor",
  "assumption", "trivial", "rfl_self", "congr", "ext", "funext",
  "ext1", "convert", "convert_to", "change", "suffices", "specialize",
  "generalize", "rename_i", "rename", "clear", "revert", "rotate_left",
  "pick_goal", "any_goals", "all_goals", "first", "repeat", "iterate",
  "try", "done", "stop", "skip", "abel", "abel_nf", "group", "noncomm_ring",
  "module", "linear_combination", "positivity", "gcongr", "mono", "mono*",
  "bound", "rel", "fin_cases", "interval_cases", "match", "fun",
  "by_cases", "if", "let", "fix", "set", "set!", "save", "fail",
  "guard_hyp", "guard_target", "guard_expr", "exact_mod_cast",
  "apply_fun", "lift", "rw_mod_cast", "norm_cast_clear", "qify",
  "rify", "zify", "lhs", "rhs", "swap", "case", "next", "first",
  "focus", "stop_at", "trace", "trace_state", "show_term", "find",
  "library_search", "polyrith_only", "tfae_have", "tfae_finish",
  "nontriviality", "decide!", "trivial!", "rfl!", "infer_instance",
  "infer_instance_as", "exact_or_check", "first_match", "rwa",
  "simpa", "simp_intros", "intro_iff", "intro_iff_one_dvd",
  "mono*_with", "mono_with", "compute_degree", "compute_degree_le",
  "polyrith_silent", "decide_using", "extract_lets", "with_reducible",
  "abel_nf at", "ring_nf at", "linarith [", "nlinarith [", "omega [",
  "norm_num [", "simp only [", "rw [", "have : ", "show ", "refine_left",
  "refine_right", "trans ", "calc_step", "match_target", "match_goal",
  "instance", "noncomputable", "abbrev", "def", "structure", "class",
  "extends", "where", "deriving", "open", "include", "omit", "variable",
  "private", "protected", "section", "namespace", "end", "universe",
  "if_then_else", "let_in", "fun_arrow", "implicit_arrow", "for_in",
  "do_block", "monad_lift", "return", "pure", "bind", "ite", "dite",
  "match_expr", "with_arg", "with_args", "set_option", "open_locale",
  "noncomm", "lift_to_quotient", "quotient_lift", "quotient_mk",
  "to_additive", "to_additive_reorder", "additivize", "deprecate",
  "alias", "register_simp_attr", "register_norm_cast", "register_label",
  "register_lemma", "register_attribute", "register_tactic"
]
